app/Models/AuthModel.php

    public function login($username){
        return $this->db->table('pegawai')->where(array(
            'username'=>$username
        ))->get()->getRowArray();
---
SELECT *
FROM `pegawai`
WHERE `username` = 'admin'